Информационная_база/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Информационная_база/src/Catalogs/Файлы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ВыбратьФайлыКомандаНаСервере(АдресВоВременномХранилище)
	
	ТекПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	ИдПользователя = ТекПользователь.Имя;
	ИмяКаталога = "C:\1CFiles\" + Строка(ИдПользователя) + "\";
	КаталогПользователя = Новый Файл(ИмяКаталога);
	Если Не КаталогПользователя.Существует() Тогда
		СоздатьКаталог(КаталогПользователя);
	КонецЕсли;       
	
	Для Каждого ФайлаИзМассива Из АдресВоВременномХранилище Цикл
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлаИзМассива.Значение);
		УдалитьИзВременногоХранилища(ФайлаИзМассива.Значение);
		ИмяФайла =  ФайлаИзМассива.Представление;
		ПолноеИмяФайла = "C:\1CFiles\" + Строка(ИдПользователя) + "\" + ИмяФайла;
		ФайлВФС = Новый Файл(ПолноеИмяФайла); 
		
		Если ФайлВФС.Существует() Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = ("Такой файл уже существует");
			Сообщение.Сообщить();
		Иначе
			НовыйОбъект = Справочники.Файлы.СоздатьЭлемент();
			НовыйОбъект.Наименование = ИмяФайла;
			НовыйОбъект.СсылкаАдрес = ПолноеИмяФайла;
			НовыйОбъект.ДатаДобавления = ТекущаяДата();
			НовыйОбъект.Записать();
			ДвоичныеДанные.Записать(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры




&НаКлиенте
Async Procedure ВыбратьФайлыКоманда(Команда)
	ДиалогВыбораФайла = New PutFilesDialogParameters;
	ДиалогВыбораФайла.MultipleChoice = True;
	СостояниеЗагрузкиФайла = New CallbackDescription("СостояниеЗагрузкиФайла", ЭтотОбъект);
	ПомещениеВВременноеХранилище = New  CallbackDescription("ПомещениеВВременноеХранилище",ЭтотОбъект);
	ФайлВВременномХранилище = Await PutFilesToServerAsync(СостояниеЗагрузкиФайла,ПомещениеВВременноеХранилище,ДиалогВыбораФайла,);
	Notify("файлыЗагружены",ФайлВВременномХранилище);
	
	For Each ОсвободитьПамять In ФайлВВременномХранилище Do
		DeleteFromTempStorage(ОсвободитьПамять.Адрес);	
	EndDo;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеВВременноеХранилище(ПомещаемыеФайлы, ОтказОтПомещенияВсехФайлов, ДополнительныеПараметры) Экспорт
	 ЭтотОбъект.Закрыть();
	//Сообщение = Новый СообщениеПользователю();
	//Сообщение.Текст = "Извините, но файл слишком большой для загрузки♂️";
	Если ПомещаемыеФайлы[0].Размер() > 14195260  Тогда
	    ОтказОтПомещенияВсехФайлов = Истина;
		//Сообщение.Сообщить();
		ПоказатьОповещениеПользователя("Извините, но файл" + Символы.ПС + "слишком большой для передачи",,,БиблиотекаКартинок.Документ,СтатусОповещенияПользователя.Информация,);
	
	КонецЕсли;
	Для Каждого ФайлаВМассива Из ПомещаемыеФайлы Цикл
		РазмерФайла = ФайлаВМассива.Размер();
		
		ДоляНаПроцент = РазмерФайла / 100;
		Шаг = ДоляНаПроцент; 
		Для  Нач = 2 По 100 Цикл
			Если РазмерФайла > 14195260 Тогда
				Прервать;
			КонецЕсли;
			
			Шаг = Шаг + ДоляНаПроцент;
			Состояние("Подготовка файла",Нач,,БиблиотекаКартинок.Документ);
			
		КонецЦикла; 
	КонецЦикла;
	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура СостояниеЗагрузкиФайла(ПомещаемыйФайл, Помещено, ОтказОтПомещенияФайла, ПомещеноВсего, ОтказОтПомещенияВсехФайлов, ДополнительныеПараметры) Экспорт
	Состояние("Загрузка на сервер" + Символы.ПС + ПомещаемыйФайл.Имя, Помещено, "Размер =" + ПомещаемыйФайл.Размер(), БиблиотекаКартинок.Документ);	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	СписокАдресовФайлов = Новый СписокЗначений;
	Если ИмяСобытия = "файлыЗагружены" Тогда
		Для Каждого АдресФайлаВХ Из Параметр Цикл
			СписокАдресовФайлов.Добавить(АдресФайлаВХ.Адрес, АдресФайлаВХ.СсылкаНаФайл.Имя);
			//УдалитьИзВременногоХранилища(АдресФайлаВХ.Адрес);
		КонецЦикла;		
	КонецЕсли;
	ВыбратьФайлыКомандаНаСервере(СписокАдресовФайлов);
	//Для  Каждого ОсвободитьПамять Из СписокАдресовФайлов Цикл
	//	УдалитьИзВременногоХранилища(ОсвободитьПамять.Значение);
	//КонецЦикла;
	
	
КонецПроцедуры

//кнопка скачивания файлов
&НаСервере
Функция СкачатьФалыКомандаНаСервере(АдресФайла)
	ЗапрашиваемыйФайл = Новый Файл(АдресФайла);   
	Возврат  ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ЗапрашиваемыйФайл.ПолноеИмя), ЭтотОбъект.УникальныйИдентификатор);;

КонецФункции

&НаКлиенте
Асинх Процедура СкачатьФалыКоманда(Команда)
	АдресВХранилище = СкачатьФалыКомандаНаСервере(Объект.СсылкаАдрес);
	ЖдемФайлыССервера = Ждать ПолучитьФайлССервераАсинх(АдресВХранилище, Объект.Наименование, Новый ПараметрыДиалогаПолученияФайлов);
КонецПроцедуры
